// 정리.cpp

// C++에서 배워야 하는 것들

// 1. class 문법은 아니지만, C에는 없던, 발전된 형태의 문법들
// => auto, template, overloading, inline, new, reference 등..
// => C#, java, swift 등의 언어를 학습해도 "C 문법 + 각 언어만의 특징"

// 2. 객체지향 언어가 공통으로 제공하는 문법 #1.
//    타입을 한개 만들때 사용하는 문법(class 관련 문법)

// => 접근 지정자 : private, public

// => 생성자, 소멸자 

// => 생성자에서 초기화시에는 "초기화리스트가 좋다" => : x(0),y(0) {} ==> C++만의특징

// => static member data, static member function

// => 멤버 함수가 내부적으로 멤버 데이타를 변경하지 않으면	
//    const member function 으로 해야 한다.					=====> C++만의 특징

// => 클래스 만들때 ".h" 와 ".cpp" 파일로 분리하는 방법.	  ====> C++만의 특징

// 다른 객체지향 언어에는 C++ 에서 없는 추가적인 문법이 있을수 있습니다.
// => 예를 들면 C#, java 에는 property 가 있습니다.
//================================================================

// 3. 여러개의 클래스들을 가지고, 프로그램 자체를 "객체지향으로 만들어 가는 방법"
// => 객체지향 디자인,
// => 가장 어려운 내용.


// 4. C++ 표준 라이브러리(STL) 사용법


// 5. 기타 : 간단한 추가 문법들..(예외, 연산자 재정의)
